#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.random_password.master_password[0]: Refreshing state... [id=none]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=16QSzg]
module.us-east-1.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02d3676472d2922b0]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_app.ansible: Refreshing state... [id=1442ea59-a90b-4ae8-9af1-f95d877fa114:ansible-app-dev]
module.us-east-1.aws_key_pair.terraform-aws: Refreshing state... [id=terraform-aws-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::023093918714:oidc-provider/token.actions.githubusercontent.com]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.ansible_ec2_role: Refreshing state... [id=ec2_ansible_role-dev]
module.us-east-1.module.platform.data.aws_route53_zone.ktech_public: Reading...
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codedeploy_role: Refreshing state... [id=ansible_codedeploy_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_kms_key.ansible_bucket_key: Refreshing state... [id=f24e6fe7-687b-4620-96c9-185240735952]
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Reading...
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.us-east-1.data.aws_availability_zones.az_zones: Reading...
module.us-east-1.data.aws_ami.amazon_linux_2: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.us-east-1.data.aws_ami.ubuntu2004: Reading...
module.us-east-1.data.aws_availability_zones.az_zones: Read complete after 0s [id=us-east-1]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.us-east-1.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0dddaa75dedf904bc]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_config.ansible: Refreshing state... [id=ansible-deployment-config-dev]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=grafana-rds-dev-20220901025450625200000001]
module.us-east-1.module.platform.module.ansible_server.aws_kms_alias.key_alias: Refreshing state... [id=alias/ansible-bucket-key]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.github_role: Refreshing state... [id=github_ansible_role-dev]
module.us-east-1.data.aws_ami.amazon_linux_2: Read complete after 0s [id=ami-0cabc39acf991f4f1]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_versioning.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_acl.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev,private]
module.us-east-1.module.platform.data.aws_route53_zone.ktech_public: Read complete after 0s [id=Z05014963P29XRPD1Q5CR]
module.us-east-1.data.aws_ami.ubuntu2004: Read complete after 0s [id=ami-0cf6c10214cc015c9]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy_attachment.AWSCodeDeployRole: Refreshing state... [id=ansible_codedeploy_role-dev-20220901025451193300000002]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_group.ansible: Refreshing state... [id=ae6ef2be-b72c-4d05-87bc-db3e791bc20f]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_instance_profile.ansible_ec2_profile: Refreshing state... [id=ec2_ansible_profile-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy_inventory: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy_inventory-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.github_policy: Refreshing state... [id=github_ansible_role-dev:github_ansible_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.codepipeline_policy: Refreshing state... [id=codepipeline_ansible_role-dev:codepipeline_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_codepipeline.codepipeline: Refreshing state... [id=ansible-deploy-pipeline-dev]
module.us-east-1.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-014c33350b76dd14b]
module.us-east-1.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-093c421963e340787]
module.us-east-1.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b7fbc62a8c06b6eb]
module.us-east-1.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e7f940b93b556467]
module.us-east-1.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0db29e051d1565f35]
module.us-east-1.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b0bf82d9a98a748f]
module.us-east-1.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-04d9db7f56179b9ab]
module.us-east-1.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ec57777273dd9f17]
module.us-east-1.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0e0e083ffd85e8a5a]
module.us-east-1.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-071f69e48a8a9b0a2]
module.us-east-1.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-026701d066786f73e]
module.us-east-1.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0644f1c2e0b9b1613]
module.us-east-1.data.aws_route53_zone.private_zone: Reading...
module.us-east-1.module.zones.aws_route53_zone.this["dev.private.ktech-br.com"]: Refreshing state... [id=Z041548714SPJ8WKUY13Q]
module.us-east-1.module.platform.aws_security_group.allow_outbound: Refreshing state... [id=sg-048aaef701d2321d8]
module.us-east-1.module.platform.aws_security_group.allow_ping: Refreshing state... [id=sg-0016c38bc377dbd85]
module.us-east-1.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b0bf82d9a98a748f1080289494]
module.us-east-1.module.platform.module.bastion.aws_security_group.bastion_public_ssh: Refreshing state... [id=sg-046ef91e14b9d343d]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_http: Refreshing state... [id=sg-02a20a763e07bfdbf]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_https: Refreshing state... [id=sg-02083946c7bcc30af]
module.us-east-1.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e069d56238507224]
module.us-east-1.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03e26ffd3446d39c3]
module.us-east-1.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02c7e1c9c2d2c1d4d]
module.us-east-1.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a79ec78f62d8ab5f]
module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0506b7105e725b8ef]
module.us-east-1.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-000ac3d9fa6ae07de]
module.us-east-1.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ef35520218bc2adb]
module.us-east-1.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0b5f45201f4e7c755]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.grafana_http_instance: Refreshing state... [id=sg-0308baf5abdf130b3]
module.us-east-1.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-014c33350b76dd14b1080289494]
module.us-east-1.module.platform.aws_security_group.allow_ansible_admin_subnet_ssh: Refreshing state... [id=sg-084fb2b1070fe78e3]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:loadbalancer/app/alb-grafana-dashboards-dev/5232553f7462a4ba]
module.us-east-1.module.platform.module.bastion.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-0f88e5e6b39ae7147]
module.us-east-1.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-us-east-1-dev]
module.us-east-1.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0cbe97484108e3eb2]
module.us-east-1.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0f17933225e4544dd]
module.us-east-1.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-01e0dbbc4d47c86ba]
module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.grafana_public: Refreshing state... [id=Z05014963P29XRPD1Q5CR_grafana.dev.ktech-devops.com.br_CNAME]
module.us-east-1.data.aws_route53_zone.private_zone: Read complete after 1s [id=Z041548714SPJ8WKUY13Q]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=grafana-rds-dev]
module.us-east-1.module.platform.aws_security_group.allow_bastion_ssh: Refreshing state... [id=sg-0d789975760882567]
module.us-east-1.module.platform.module.bastion.aws_route53_record.bastion_public: Refreshing state... [id=Z05014963P29XRPD1Q5CR_bastion.dev.ktech-devops.com.br_A]
module.us-east-1.module.platform.module.ansible_server.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-0f63a1b1e51457bab]
module.us-east-1.module.platform.module.grafana_dashboards.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-0ba4481409da08a12]
module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3050635943]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/graf-20220901025727288600000005/938d30540749eda5]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group_attachment.this["0.target"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/graf-20220901025727288600000005/938d30540749eda5-20220901025728051500000006]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:listener/app/alb-grafana-dashboards-dev/5232553f7462a4ba/ff92410e6e066c83]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.us-east-1.module.platform.module.ansible_server.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ansible.dev.private.ktech-br.com"
      + records         = [
          + "10.1.1.210",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z041548714SPJ8WKUY13Q"
    }

  # module.us-east-1.module.platform.module.bastion.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion.dev.private.ktech-br.com"
      + records         = [
          + "10.1.101.95",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z041548714SPJ8WKUY13Q"
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grafana.dev.private.ktech-br.com"
      + records         = [
          + "10.1.2.40",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z041548714SPJ8WKUY13Q"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 23, in module "us-east-1":
  23:     aws = aws.use1

There is no explicit declaration for local provider name "aws" in
module.us-east-1, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kaio6fellipe, Action: `pull_request`*